---
type: SystemsAnalysisOptions
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 6
tags: [revit-api, class]
---

# SystemsAnalysisOptions

`Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SystemsAnalysisOptions | 2020.1 | `public SystemsAnalysisOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OutputFolder | 2020.1 | `public string OutputFolder { get ; set ; }` |
| Property | WeatherFile | 2020.1 | `public string WeatherFile { get ; set ; }` |
| Property | WorkflowFile | 2020.1 | `public string WorkflowFile { get ; set ; }` |